In [ ]:
"""
find out employees with the rank of their first_name ascending being odd, do not sort in output
"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  `employees` ; 
CREATE TABLE `employees` (
  `emp_no` int(11) NOT NULL,
  `birth_date` date NOT NULL,
  `first_name` varchar(14) NOT NULL,
  `last_name` varchar(16) NOT NULL,
  `gender` char(1) NOT NULL,
  `hire_date` date NOT NULL,
  PRIMARY KEY (`emp_no`));

INSERT INTO employees VALUES(10001,'1953-09-02','Georgi','Facello','M','1986-06-26');
INSERT INTO employees VALUES(10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21');
INSERT INTO employees VALUES(10005,'1955-01-21','Kyoichi','Maliniak','M','1989-09-12');
INSERT INTO employees VALUES(10006,'1953-04-20','Anneke','Preusig','F','1989-06-02');

In [ ]:
"""SQL solution"""
# 1
SELECT a.first_name
FROM
(SELECT emp_no, first_name, (@r := @r + 1) AS fname_rank
FROM (SELECT * FROM employees ORDER BY first_name) AS o, (SELECT @r := 0) AS r) AS a
WHERE MOD(ROUND(fname_rank), 2) = 1
ORDER BY a.emp_no

# 2
SELECT a.first_name
FROM
(SELECT emp_no, first_name, (@r := @r + 1) AS fname_rank
FROM (SELECT * FROM employees ORDER BY first_name) AS o, (SELECT @r := 0) AS r) AS a
WHERE fname_rank % 2 = 1
ORDER BY a.emp_no

# 3
SELECT first_name
FROM employees
WHERE first_name IN
(SELECT a.first_name FROM
(SELECT emp_no, first_name, (@r := @r + 1) AS fname_rank
FROM (SELECT * FROM employees ORDER BY first_name) AS o, (SELECT @r := 0) AS r) AS a
WHERE fname_rank % 2 = 1)

In [1]:
"""pandas dataframe creation"""
import pandas as pd
import numpy as np

t_emp = np.array([[10001,'1953-09-02','Georgi','Facello','M','1986-06-26'],
                  [10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21'],
                  [10005,'1955-01-21','Kyoichi','Maliniak','M','1989-09-12'],
                  [10006,'1953-04-20','Anneke','Preusig','F','1989-06-02']])
employees = pd.DataFrame(data=t_emp, columns=['emp_no', 'birth_date', 'first_name', 'last_name', 'gender', 'hire_date'])
employees.head()

  emp_no  birth_date first_name last_name gender   hire_date
0  10001  1953-09-02     Georgi   Facello      M  1986-06-26
1  10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2  10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
3  10006  1953-04-20     Anneke   Preusig      F  1989-06-02

In [6]:
employees['fn_rank'] = employees['first_name'].rank().astype('int')
pd.DataFrame(employees.loc[employees['fn_rank']%2 == 1, 'first_name'], columns=['first_name'])

  first_name
0     Georgi
3     Anneke